import matplotlib.pyplot as plt

N = 1000
D1 = 900  # исправный подшипник
D2 = 100  # неисправный подшипник

# K1 - вибрація
# K11 - вибрація в діапазоні 0,25-0,5
# K12 - вибрація в діапазоні 0,5-0,75
# K13 - вибрація в діапазоні >0,75
PrK11_D1 = 0.7
PrK12_D1 = 0.2
PrK13_D1 = 0.1
PrK11_D2 = 0.05
PrK12_D2 = 0.15
PrK13_D2 = 0.8

# K2 - температура
# K21 - температура в діапазоні 50-70 С
# K22 - температура в діапазоні 70-90 С
# K23 - температура >90 С
PrK21_D1 = 0.8
PrK22_D1 = 0.1
PrK23_D1 = 0.1
PrK21_D2 = 0.07
PrK22_D2 = 0.08
PrK23_D2 = 0.85

# K3 - забруднення мастила
# K31 - в межах норми
# K32 - підвищене
PrK31_D1 = 0.9
PrK32_D1 = 0.1
PrK31_D2 = 0.3
PrK32_D2 = 0.7

# Вхідні дані згідно з умовами
print('При спостереженні:')
print(' Вібрація > 0.75g (признак k13);')
print(' Температура 50-70°C (признак k21);')
print(' Забруднення мастила в межах норми (признак k31).')

PrK_D1 = PrK13_D1 * PrK21_D1 * PrK31_D1
PrK_D2 = PrK13_D2 * PrK21_D2 * PrK31_D2
PrD1 = D1 / N
PrD2 = D2 / N

PrD1_K = PrD1 * PrK_D1 / (PrD1 * PrK_D1 + PrD2 * PrK_D2)
PrD2_K = PrD2 * PrK_D2 / (PrD1 * PrK_D1 + PrD2 * PrK_D2)

print('Ймовірність справного стану (діагноз D1) складає:')
print(PrD1_K)
print('Ймовірність несправного стану (діагноз D2) складає:')
print(PrD2_K)

# Повторимо для попереднього стану, коли було справним стан і спостерігалася вібрація 0,5-0,75g
print('---\nПопередній стан:')
print(' Вібрація 0.5-0.75g (признак k12);')
print(' Температура 50-70°C (признак k21);')
print(' Забруднення мастила в межах норми (признак k31).')

PrK_D1_prev = PrK12_D1 * PrK21_D1 * PrK31_D1
PrK_D2_prev = PrK12_D2 * PrK21_D2 * PrK31_D2

PrD1_K_prev = PrD1 * PrK_D1_prev / (PrD1 * PrK_D1_prev + PrD2 * PrK_D2_prev)
PrD2_K_prev = PrD2 * PrK_D2_prev / (PrD1 * PrK_D1_prev + PrD2 * PrK_D2_prev)

print('Ймовірність справного стану (діагноз D1) складає:')
print(PrD1_K_prev)
print('Ймовірність несправного стану (діагноз D2) складає:')
print(PrD2_K_prev)

# Побудова графіку для двох станів
X = [1, 2]
Y = [round(PrD1_K * 100, 2), round(PrD2_K * 100, 2)]
Y_prev = [round(PrD1_K_prev * 100, 2), round(PrD2_K_prev * 100, 2)]

plt.bar(X, Y, label='Поточний стан', color='b', alpha=0.8)
plt.bar(X, Y_prev, label='Попередній стан', color='r', alpha=0.7)

plt.text(X[0], Y[0] / 2, 'Справний стан', ha='center')
plt.text(X[1], Y[1] / 2, 'Несправний стан', ha='center')

plt.xlabel('Діагнози')
plt.ylabel('Ймовірність діагнозу (%)')
plt.legend()
plt.show()
